---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShape
source: html/f1bb25f3-e18c-9a77-ff9d-704f76e9a69f.htm
---
# RebarShape Properties

The id of the assembly instance to which the element belongs.